app/controllers/api/v1/billings_controller.rb

SELECT  "billings".* FROM "billings" WHERE "billings"."id" = ? AND "billings"."student_id" = ? LIMIT ?  [["id", 1], ["student_id", 1], ["LIMIT", 1]]
---
      def set_billing
        @billing = Billing.find_by(id: billing_params[:id], student_id: billing_params[:student_id])